uhnp/src/InformationRegisters/тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам/тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам</name>
  <comment>// Юдина (Гутарова) Екатерина 15.07.2024 Выполнение задач №000050218</comment>
  <resources>
    <name>ПодразделениеПолучатель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Статья</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>Аналитика</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.тн_ВидыДокументовОтчетКомитентаПоЗакупкам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьДанныеДляЗаполненияДокумента(Контрагент, ВидДокумента) Экспорт

	Результат = Неопределено;
	
	Запрос = Новый Запрос;      
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидДокумента", ВидДокумента);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам.ПодразделениеПолучатель КАК ПодразделениеПолучатель,
	               |	тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам.Статья КАК Статья,
	               |	тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам.Аналитика КАК Аналитика
	               |ИЗ
	               |	РегистрСведений.тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам КАК тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам
	               |ГДЕ
	               |	тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам.Контрагент = &Контрагент
	               |	И тн_ДанныеДляЗаполненияДокументовПоОтчетуКомитентаПоЗакупкам.ВидДокумента = &ВидДокумента";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура;
		Результат.Вставить("ПодразделениеПолучатель", Выборка.ПодразделениеПолучатель);
		Результат.Вставить("Статья",                  Выборка.Статья);
		Результат.Вставить("Аналитика",               Выборка.Аналитика);
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции		
	
#КонецЕсли
